{
  "1": "Entendo sua preocupação. Cada mulher vive o puerpério de forma única. Lembre-se de que você não está sozinha e que é normal ter dúvidas. Se precisar de ajuda específica, não hesite em procurar seu médico ou profissionais de saúde.",
  "2": "Você está passando por uma fase intensa e transformadora. É importante ser gentil consigo mesma e aceitar apoio. Suas preocupações são válidas e vale a pena buscar informações confiáveis e suporte profissional quando necessário.",
  "3": "O puerpério é um período de muitas mudanças físicas e emocionais. É completamente normal ter dúvidas e sentimentos diversos. Cuide de si mesma, descanse quando possível e não hesite em pedir ajuda quando precisar.",
  "4": "Sei que pode ser difícil lidar com tantas mudanças ao mesmo tempo. Você está fazendo o melhor possível em uma situação completamente nova. Lembre-se: não existe 'mãe perfeita', apenas mães que amam e fazem o que podem.",
  "5": "Seus sentimentos são válidos e importantes. Não se compare com outras mães - cada jornada é única. Converse com quem você confia, cuide da sua saúde física e emocional, e saiba que procure ajuda profissional quando sentir necessidade.",
  "6": "O puerpério pode ser um turbilhão de emoções. É normal se sentir confusa, cansada ou insegura. Descanse, alimente-se bem, hidrate-se e aceite ajuda quando oferecida. Você não precisa fazer tudo sozinha.",
  "7": "Você acabou de passar por uma transformação incrível. Dê tempo ao seu corpo e mente para se adaptarem. Pequenos passos são suficientes. O importante é que você e seu bebê estejam bem.",
  "8": "As primeiras semanas podem ser desafiadoras, mas também são um período de aprendizado e descobertas. Confie no seu instinto materno, mas também busque informação e suporte quando precisar. Você está fazendo um trabalho importante.",
  "9": "Respire fundo. Você está se readaptando a uma nova realidade. Não há problema em ter dúvidas ou sentir-se sobrecarregada. O mais importante é cuidar da sua saúde e estar presente para você e seu bebê.",
  "10": "Cada dia é uma vitória. Você está aprendendo a ser mãe enquanto recupera seu corpo e reorganiza sua vida. Seja paciente consigo mesma. Mudanças levam tempo e está tudo bem não saber todas as respostas."
}
